In [1]:
import pandas as pd

# Transform: cleaning dataframe to prepare for import into SQL
<hr>

## place_types SQL database
<br>

In [2]:
# Load previously created CSV containing 
# place types as a Pandas DataFrame

places_csv = "01_Outputs/melb_suburbs_types.csv"

df = pd.read_csv(places_csv)
df.head()

,suburb,postcode,state,dc,type,lat,lon,No liquor_store,No police,No park
0,abbotsford,3067,VIC,FITZROY DC,Delivery Area,-37.801781,144.998752,15.0,1.0,20.0
1,aberfeldie,3040,VIC,MOONEE PONDS DC,Delivery Area,-37.756690,144.896259,1.0,0.0,16.0
2,airport west,3042,VIC,NIDDRIE DC,Delivery Area,-37.711698,144.887037,4.0,0.0,4.0
3,albanvale,3021,VIC,ST ALBANS DC,Delivery Area,-37.745934,144.770027,2.0,0.0,9.0
4,albert park,3206,VIC,SOUTH MELBOURNE DC,Delivery Area,-37.840705,144.955710,14.0,1.0,20.0

In [3]:
# Get places names from column headers 
# and save it as a list

columns = df.columns.to_list()
save_cols = list()
for column in columns:
    try:
        col_split = column.split("No ")
        save_cols.append(col_split[1])
    except:
        print(f"Column name {column} not affected")

Column name suburb not affected
Column name postcode not affected
Column name state not affected
Column name dc not affected
Column name type not affected
Column name lat not affected
Column name lon not affected

In [4]:
save_cols

['liquor_store', 'police', 'park']

In [5]:
# Save column names list as dataframe

cols_df = pd.DataFrame({"place_type":save_cols})
cols_df

     place_type
0  liquor_store
1        police
2          park

In [6]:
places_df = cols_df.reset_index()
places_df

   index    place_type
0      0  liquor_store
1      1        police
2      2          park

In [7]:
# Rename index column to place_id

places_df = places_df.rename(columns={"index":"place_id"})
places_df.set_index("place_id", inplace=True)
places_df

            place_type
place_id
0         liquor_store
1               police
2                 park

In [8]:
# Reset index to include place_id as column in DataFrame
places_df = places_df.reset_index(drop=False)
places_df

   place_id    place_type
0         0  liquor_store
1         1        police
2         2          park

## Export CSV

In [9]:
# Export DataFrame as a CSV file to relevant folder locations

places_df.to_csv("01_Outputs/places_types.csv", index=False)
places_df.to_csv("../005_Load_SQL/01_Inputs/places_types.csv", index=False)